exemplos/ConsultarNfseServicoPrestado/request.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://nfse.abrasf.org.br"
>
    <soap:Body>
        <tns:ConsultarNfseServicoPrestado>
            <ConsultarNfseServicoPrestadoEnvio>
                <Pagina>1</Pagina>
                <PeriodoCompetencia>
                    <DataInicial>2023-01-05</DataInicial>
                    <DataFinal>2023-01-05</DataFinal>
                </PeriodoCompetencia>
                <Prestador>
                    <CpfCnpj>
                        <Cnpj>ANON_CNPJ_123456789</Cnpj>
                    </CpfCnpj>
                    <InscricaoMunicipal>ANON_INSCR_MUNICIPAL</InscricaoMunicipal>
                </Prestador>
                <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                    <SignedInfo>
                        <CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                        <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                        <Reference URI="">
                            <Transforms>
                                <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                                <Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                            </Transforms>
                            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                            <DigestValue>ANON_DIGEST_VALUE</DigestValue>
                        </Reference>
                    </SignedInfo>
                    <SignatureValue>ANON_SIGNATURE_VALUE</SignatureValue>
                    <KeyInfo>
                        <X509Data>
                            <X509Certificate>ANON_X509_CERTIFICATE</X509Certificate>
                        </X509Data>
                    </KeyInfo>
                </Signature>
            </ConsultarNfseServicoPrestadoEnvio>
        </tns:ConsultarNfseServicoPrestado>
    </soap:Body>
</soap:Envelope>