exemplos/CancelarNfse/request.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://nfse.abrasf.org.br"
>
    <soap:Body>
        <tns:CancelarNfse>
            <CancelarNfseEnvio>
                <Pedido>
                    <InfPedidoCancelamento Id="_0">
                        <IdentificacaoNfse>
                            <CpfCnpj>
                                <Cnpj>ANON_CNPJ_PRESTADOR</Cnpj>
                            </CpfCnpj>
                            <InscricaoMunicipal>ANON_INSCRICAO_MUNICIPAL</InscricaoMunicipal>
                            <Numero>ANON_NUMERO_NOTA</Numero>
                            <CodigoMunicipio>3509502</CodigoMunicipio>
                        </IdentificacaoNfse>
                        <CodigoCancelamento>2</CodigoCancelamento>
                    </InfPedidoCancelamento>
                    <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                        <SignedInfo>
                            <CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                            <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                            <Reference URI="#_0">
                                <Transforms>
                                    <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                                    <Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                                </Transforms>
                                <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                                <DigestValue>ANON_DIGEST_VALUE</DigestValue>
                            </Reference>
                        </SignedInfo>
                        <SignatureValue>ANON_SIGNATURE_VALUE</SignatureValue>
                        <KeyInfo>
                            <X509Data>
                                <X509Certificate>ANON_CERTIFICADO_X509</X509Certificate>
                            </X509Data>
                        </KeyInfo>
                    </Signature>
                </Pedido>
            </CancelarNfseEnvio>
        </tns:CancelarNfse>
    </soap:Body>
</soap:Envelope>